#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Thu May  6 00:16:53 2021
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 60 -waveform {0 30} -name vsysclk 
group_path -name I2R -from [list [get_ports work] [get_ports {in2[0]}] [get_ports {in2[1]}] [get_ports {in2[2]}] [get_ports {in1[0]}] [get_ports {in1[1]}] [get_ports {in1[2]}]]
group_path -name I2O -from [list [get_ports work] [get_ports {in2[0]}] [get_ports {in2[1]}] [get_ports {in2[2]}] [get_ports {in1[0]}] [get_ports {in1[1]}] [get_ports {in1[2]}]]  -to [list [get_ports done] [get_ports {bitIndx[0]}] [get_ports {bitIndx[1]}] [get_ports {bitIndx[2]}] [get_ports {bitIndx[3]}] [get_ports {byteIndx[0]}] [get_ports {byteIndx[1]}] [get_ports {byteIndx[2]}] [get_ports {byteIndx[3]}] [get_ports {byteIndx[4]}] [get_ports {byteIndx[5]}] [get_ports {byteIndx[6]}] [get_ports {byteIndx[7]}] [get_ports {byteIndx[8]}] [get_ports {byteIndx[9]}] [get_ports {byteIndx[10]}] [get_ports {byteIndx[11]}] [get_ports {byteIndx[12]}] [get_ports {byteIndx[13]}] [get_ports {byteIndx[14]}] [get_ports {byteIndx[15]}] [get_ports {byteIndx[16]}] [get_ports {byteIndx[17]}] [get_ports {byteIndx[18]}] [get_ports {byteIndx[19]}] [get_ports {byteIndx[20]}] [get_ports {byteIndx[21]}] [get_ports {byteIndx[22]}] [get_ports {byteIndx[23]}] [get_ports {byteIndx[24]}] [get_ports {byteIndx[25]}] [get_ports {byteIndx[26]}] [get_ports {byteIndx[27]}] [get_ports {byteIndx[28]}] [get_ports {byteIndx[29]}] [get_ports {byteIndx[30]}] [get_ports {byteIndx[31]}] [get_ports {out[0]}] [get_ports {out[1]}] [get_ports {out[2]}] [get_ports {out[3]}] [get_ports {out[4]}] [get_ports {out[5]}] [get_ports {out[6]}] [get_ports {out[7]}]]
group_path -name R2O -to [list [get_ports done] [get_ports {bitIndx[0]}] [get_ports {bitIndx[1]}] [get_ports {bitIndx[2]}] [get_ports {bitIndx[3]}] [get_ports {byteIndx[0]}] [get_ports {byteIndx[1]}] [get_ports {byteIndx[2]}] [get_ports {byteIndx[3]}] [get_ports {byteIndx[4]}] [get_ports {byteIndx[5]}] [get_ports {byteIndx[6]}] [get_ports {byteIndx[7]}] [get_ports {byteIndx[8]}] [get_ports {byteIndx[9]}] [get_ports {byteIndx[10]}] [get_ports {byteIndx[11]}] [get_ports {byteIndx[12]}] [get_ports {byteIndx[13]}] [get_ports {byteIndx[14]}] [get_ports {byteIndx[15]}] [get_ports {byteIndx[16]}] [get_ports {byteIndx[17]}] [get_ports {byteIndx[18]}] [get_ports {byteIndx[19]}] [get_ports {byteIndx[20]}] [get_ports {byteIndx[21]}] [get_ports {byteIndx[22]}] [get_ports {byteIndx[23]}] [get_ports {byteIndx[24]}] [get_ports {byteIndx[25]}] [get_ports {byteIndx[26]}] [get_ports {byteIndx[27]}] [get_ports {byteIndx[28]}] [get_ports {byteIndx[29]}] [get_ports {byteIndx[30]}] [get_ports {byteIndx[31]}] [get_ports {out[0]}] [get_ports {out[1]}] [get_ports {out[2]}] [get_ports {out[3]}] [get_ports {out[4]}] [get_ports {out[5]}] [get_ports {out[6]}] [get_ports {out[7]}]]
set_load 10 [get_ports {out[7]}]
set_load 10 [get_ports {out[6]}]
set_load 10 [get_ports {out[5]}]
set_load 10 [get_ports {out[4]}]
set_load 10 [get_ports {out[3]}]
set_load 10 [get_ports {out[2]}]
set_load 10 [get_ports {out[1]}]
set_load 10 [get_ports {out[0]}]
set_load 10 [get_ports {byteIndx[31]}]
set_load 10 [get_ports {byteIndx[30]}]
set_load 10 [get_ports {byteIndx[29]}]
set_load 10 [get_ports {byteIndx[28]}]
set_load 10 [get_ports {byteIndx[27]}]
set_load 10 [get_ports {byteIndx[26]}]
set_load 10 [get_ports {byteIndx[25]}]
set_load 10 [get_ports {byteIndx[24]}]
set_load 10 [get_ports {byteIndx[23]}]
set_load 10 [get_ports {byteIndx[22]}]
set_load 10 [get_ports {byteIndx[21]}]
set_load 10 [get_ports {byteIndx[20]}]
set_load 10 [get_ports {byteIndx[19]}]
set_load 10 [get_ports {byteIndx[18]}]
set_load 10 [get_ports {byteIndx[17]}]
set_load 10 [get_ports {byteIndx[16]}]
set_load 10 [get_ports {byteIndx[15]}]
set_load 10 [get_ports {byteIndx[14]}]
set_load 10 [get_ports {byteIndx[13]}]
set_load 10 [get_ports {byteIndx[12]}]
set_load 10 [get_ports {byteIndx[11]}]
set_load 10 [get_ports {byteIndx[10]}]
set_load 10 [get_ports {byteIndx[9]}]
set_load 10 [get_ports {byteIndx[8]}]
set_load 10 [get_ports {byteIndx[7]}]
set_load 10 [get_ports {byteIndx[6]}]
set_load 10 [get_ports {byteIndx[5]}]
set_load 10 [get_ports {byteIndx[4]}]
set_load 10 [get_ports {byteIndx[3]}]
set_load 10 [get_ports {byteIndx[2]}]
set_load 10 [get_ports {byteIndx[1]}]
set_load 10 [get_ports {byteIndx[0]}]
set_load 10 [get_ports {bitIndx[3]}]
set_load 10 [get_ports {bitIndx[2]}]
set_load 10 [get_ports {bitIndx[1]}]
set_load 10 [get_ports {bitIndx[0]}]
set_load 10 [get_ports done]
set_input_transition 0.1 [get_ports {in1[2]}]
set_input_transition 0.1 [get_ports {in1[1]}]
set_input_transition 0.1 [get_ports {in1[0]}]
set_input_transition 0.1 [get_ports {in2[2]}]
set_input_transition 0.1 [get_ports {in2[1]}]
set_input_transition 0.1 [get_ports {in2[0]}]
set_input_transition 0.1 [get_ports work]
set_input_delay 0.7 [get_ports {in1[2]}]
set_input_delay 0.7 [get_ports {in1[1]}]
set_input_delay 0.7 [get_ports {in1[0]}]
set_input_delay 0.7 [get_ports {in2[2]}]
set_input_delay 0.7 [get_ports {in2[1]}]
set_input_delay 0.7 [get_ports {in2[0]}]
set_input_delay 0.7 [get_ports work]
set_output_delay 18 -clock vsysclk [get_ports {out[7]}]
set_output_delay 18 -clock vsysclk [get_ports {out[6]}]
set_output_delay 18 -clock vsysclk [get_ports {out[5]}]
set_output_delay 18 -clock vsysclk [get_ports {out[4]}]
set_output_delay 18 -clock vsysclk [get_ports {out[3]}]
set_output_delay 18 -clock vsysclk [get_ports {out[2]}]
set_output_delay 18 -clock vsysclk [get_ports {out[1]}]
set_output_delay 18 -clock vsysclk [get_ports {out[0]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[31]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[30]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[29]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[28]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[27]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[26]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[25]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[24]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[23]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[22]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[21]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[20]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[19]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[18]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[17]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[16]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[15]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[14]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[13]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[12]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[11]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[10]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[9]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[8]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[7]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[6]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[5]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[4]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[3]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[2]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[1]}]
set_output_delay 18 -clock vsysclk [get_ports {byteIndx[0]}]
set_output_delay 18 -clock vsysclk [get_ports {bitIndx[3]}]
set_output_delay 18 -clock vsysclk [get_ports {bitIndx[2]}]
set_output_delay 18 -clock vsysclk [get_ports {bitIndx[1]}]
set_output_delay 18 -clock vsysclk [get_ports {bitIndx[0]}]
set_output_delay 18 -clock vsysclk [get_ports done]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
